import positiveIcon from "../../assets/icons/happy-face.png";
import negativeIcon from "../../assets/icons/bad.png";
import neutralistIcon from "../../assets/icons/neutral-face.png";
import actionIcon from "../../assets/icons/action.png";
import animalIcon from "../../assets/icons/paw.png";
import othersIcon from "../../assets/icons/more.png";

import happyIcon from "../../assets/icons/smiley.png";
import loveIcon from "../../assets/icons/heart.png";
import awkwardIcon from "../../assets/icons/nervous.png";
import sympathyIcon from "../../assets/icons/charity.png";

import disappointedIcon from "../../assets/icons/disappointed.png";
import angryIcon from "../../assets/icons/broken.png";
import sadIcon from "../../assets/icons/sad-face.png";
import painfulIcon from "../../assets/icons/headache.png";
import fearIcon from "../../assets/icons/ghost.png";

import apatheticIcon from "../../assets/icons/apathetic.png";
import forgetfulIcon from "../../assets/icons/forgetfulness.png";
import suspectIcon from "../../assets/icons/suspect.png";
import surpriseIcon from "../../assets/icons/exclamation.png";

import greetingIcon from "../../assets/icons/hi.png";
import embraceIcon from "../../assets/icons/hug.png";
import winkIcon from "../../assets/icons/wink.png";
import apologizeIcon from "../../assets/icons/sorry.png";
import nosebleedIcon from "../../assets/icons/nose-bleeding.png";
import hideIcon from "../../assets/icons/shy.png";
import writeIcon from "../../assets/icons/writing.png";
import runIcon from "../../assets/icons/running.png";
import sleepIcon from "../../assets/icons/slumber.png";

import catIcon from "../../assets/icons/happy.png";
import bearIcon from "../../assets/icons/bear.png";
import dogIcon from "../../assets/icons/dog.png";
import rabbitIcon from "../../assets/icons/rabbit.png";
import pigIcon from "../../assets/icons/pig.png";
import birdIcon from "../../assets/icons/bird.png";
import fishIcon from "../../assets/icons/fish.png";

import friendIcon from "../../assets/icons/support.png";
import enemyIcon from "../../assets/icons/ghost(1).png";
import weaponIcon from "../../assets/icons/swords.png";
import magicIcon from "../../assets/icons/magic-wand.png";
import foodIcon from "../../assets/icons/three-rolls.png";
import musicIcon from "../../assets/icons/musical-note.png";
import gameIcon from "../../assets/icons/console.png";
import faceIcon from "../../assets/icons/face-id.png";
import specialIcon from "../../assets/icons/badge.png";

export const kaomoji = {
  positive: {
    img: positiveIcon,
    happy: {
      img: happyIcon,
      langs: { vi: "vui sướng" },
      icons: [
        "(* ^ ω ^)", "(o ^ ▽ ^ o)", "ヽ (・ ∀ ・) ﾉ", "(o ･ ω ･ o)", "(^ 人 ^)", "(´ ω `)", "(´ • ω • `)",
        "╰ (▔∀▔) ╯", "(✯◡✯)", "(⌒‿⌒)", "(* ° ▽ ° *)", "(´｡ • ᵕ • ｡`)", "ヽ (> ∀ <☆) ノ", "＼ (￣ ▽ ￣) ／",
        "(o˘◡˘o)", "(╯✧ ▽ ✧) ╯", "(‾́ ◡ ‾́)", "(๑˘︶˘๑)", "(´ ･ ᴗ ･ `)", "(⁀ᗢ⁀)", "(˙▿˙)", "(´ ∀ `*)",
        "(⌒ ▽ ⌒) ☆", "(´｡ • ω • ｡`)", "(＠ ＾ ◡ ＾)", "(o´ ▽ `o)", "(((o (* ° ▽ ° *) o)))",
        "(＾ ▽ ＾)", "(─‿‿─)", "(◕‿◕)", "＼ (≧ ▽ ≦) ／", "٩ (｡ • ́‿ • ̀｡) ۶", "(´ ▽ `)", "o (≧ ▽ ≦) o",
        "(* ¯︶¯ *)", "\\ (★ ω ★) /", "o (> ω <) o", "(ﾉ ´ ヮ `) ﾉ *: ･ ﾟ", "(˙꒳ ˙)", "(ﾉ ◕ ヮ ◕) ﾉ *: ･ ﾟ ✧",
        "(￢‿￢)", "(¯▿¯)", "٩ (◕‿◕｡) ۶", "<(￣︶￣)>", "(￣ω￣)", "ヽ (* ・ ω ・) ﾉ", "(* ´ ▽ `*)", "(≧ ◡ ≦)",
        "(⌒ω⌒)", "(* ^ ‿ ^ *)", "(* ≧ ω ≦ *)", "ヽ (o ＾ ▽ ＾ o) ノ", "(✧ω✧)", "(￣ ▽ ￣)", "(☆ ω ☆)",
        "＼ (＾ ▽ ＾) ／", "\\ (^ ヮ ^) /", "o (❛ᴗ❛) o", "(b ᵔ ▽ ᵔ) b", "(* ꒦ ິ ꒳꒦ ີ)", "(„• – •„)",
        "(¬‿¬)", "☆ *: .｡. o (≧ ▽ ≦) o .｡.: * ☆", "。.: ☆ *: ･ ‘(* ⌒ ― ⌒ *)))", "｀;: ゛; ｀; ･ (° ε °)",
        "(o_ _) ﾉ 彡 ☆", "｡ ﾟ (ﾟ ^ ∀ ^ ﾟ) ﾟ｡", "(o´∀`o)", "∑d (° ∀ ° d)", "ヽ (o ^ ^ o) ﾉ", "(☆ ▽ ☆)",
        "☆ ～ (‘▽ ^ 人)", "ヽ (* ⌒ ▽ ⌒ *) ﾉ", "╰ (* ´︶` *) ╯", "(っ ˘ω˘ς)", "٩ (◕‿◕) ۶", "(〃 ＾ ▽ ＾ 〃)",
        "｡ ﾟ (T ヮ T) ﾟ｡", "(๑˃ᴗ˂) ﻭ", "° ˖✧◝ (⁰▿⁰) ◜✧˖ °", "(.❛ ᴗ ❛.)", "(* ￣ ▽ ￣) b"
      ],
    },
    love: {
      img: loveIcon,
      langs: { vi: "yêu và quý" },
      icons: [
        "(ﾉ ´ з `) ノ", "(♡ -_- ♡)", "(─‿‿─) ♡", "(´ ω `♡)", "(ღ˘⌣˘ღ)", "(´ • ω • `) ♡", "╰ (* ´︶` *) ╯ ♡",
        "(≧ ◡ ≦) ♡", "♡ (˘ ▽ ˘> ԅ (˘⌣˘)", "σ (≧ ε ≦ σ) ♡", "(˘∀˘) / (μ‿μ) ❤", "Σ> – (〃 ° ω ° 〃) ♡ →",
        "(♡ μ_μ)", "(￣ε￣ ＠)", "(´｡ • ᵕ • ｡`) ♡", "♡ (◡‿◡)", "(♡ ° ▽ ° ♡)", "(´ ε `) ♡",
        "(* ˘︶˘ *) .｡.: * ♡", "(⌒ ▽ ⌒) ♡", "(˘⌣˘) ♡ (˘⌣˘)", "♡ (⇀ 3 ↼)", "❤ (ɔˆз (ˆ⌣ˆc)",
        "(´ ,, • ω • ,,) ♡", "(* ^^ *) ♡", "ヽ (♡ ‿ ♡) ノ", "(* ♡ ∀ ♡)", "(◕‿◕) ♡", "♡ (｡- ω -)",
        "(´｡ • ω • ｡`) ♡", "(♡ ˙︶˙ ♡)", "(* ¯ ³¯ *) ♡", "(/ ^ – ^ (^ ^ *) / ♡", "♡ (￣З￣)", "(´ ♡ ‿ ♡ `)",
        "☆ ⌒ ヽ (* ‘､ ^ *) chu", "(´ ∀ `) ノ ～ ♡", "(｡ ・ // ε // ・｡)", "(/▽＼*)｡o○♡", "♡ ～ (‘▽ ^ 人)",
        "(´ ▽ `) .｡ ｏ ♡", "♡ ＼ (￣ ▽ ￣) ／ ♡", "(っ ˘з (˘⌣˘) ♡", "٩ (♡ ε ♡) ۶", "(❤ω❤)", "(° ◡ ° ♡)"
      ],
    },
    awkward: {
      img: awkwardIcon,
      langs: { vi: "lúng túng" },
      icons: [
        "(⌒_⌒;)", "(* / _ ＼)", "(◡‿◡ *)", "(// ω //)", "(￣ ▽ ￣ *) ゞ", "(„ಡ ω ಡ„)", "(o ^ ^ o)",
        "(* ﾉ ω ﾉ)", "(ᵔ.ᵔ)", "(ノ * ° ▽ ° *)", "(⁄ ⁄ • ⁄ω⁄ • ⁄ ⁄)", "(ง ื ▿ ื) ว", "(* / ω＼)",
        "(o -_- o)", "(* ﾉ ∀` *)", "(* ^. ^ *)", "(* / ▽ ＼ *)", "(〃 ▽ 〃)", "(* /。 ＼)", "(* μ_μ)",
        "(// ▽ //)", "(* ﾉ ▽ ﾉ)", "(⁄ ⁄> ⁄ ▽ ⁄ <⁄ ⁄)"
      ],
    },
    sympathy: {
      img: sympathyIcon,
      langs: { vi: "cảm thông" },
      icons: [
        "(ノ _ <。) ヾ (´ ▽ `)", "ヽ (￣ω￣ (。。) ゝ", "(ﾉ _ ；) ヾ (´ ∀ `)", "(´-ω-`(_ _)",
        "｡ ･ ﾟ ･ (ﾉ Д`) ヽ (￣ω￣)", "(* ´ Tôi `) ﾉ ﾟ (ﾉ Д ｀ ﾟ) ﾟ｡", "(; ω;) ヾ (´∀` *)", "(っ ´ω`) ﾉ (╥ω╥)",
        "ρ (- ω – 、) ヾ (￣ω￣;)", "ヽ (~ _ ~ (・ _ ・) ゝ", "(* ´ ー) ﾉ (ノ д`)",
        "(ｏ ・ _ ・) ノ ”(ノ _ <、)"
      ],
    }
  },
  negative: {
    img: negativeIcon,
    disappointed: {
      img: disappointedIcon,
      langs: { vi: "không hài lòng" },
      icons: [
        "(＃ ＞ ＜)", "(； ￣Д￣)", "(￢_￢;)", "(＾＾ ＃)", "(￣︿￣)", "ヾ (￣O￣) ツ", "(ᗒᗣᗕ)՞", "(； ⌣̀_⌣́)",
        "(￣ □ ￣ 」)", "(＞ ｍ ＜)", "(︶︹︺)", "(＞ ﹏ ＜)", "(⇀‸↼ ‶)", "(눈 _ 눈)", "☆ ｏ (＞ ＜ ；) ○",
        "(＃ ￣0￣)", "(」° ロ °)」", "(￣ ヘ ￣)", "(–_–)", "o (> <) o", "(￣ ￣ |||)", "(＃ ￣ω￣)",
        "(〃 ＞ ＿ ＜; 〃)", "<(￣ ﹌ ￣)>", "凸 (￣ ヘ ￣)", "(」＞ ＜)」"
      ],
    },
    angry: {
      img: angryIcon,
      langs: { vi: "phẫn nộ" },
      icons: [
        "(＃ `Д´)", "(・ `Ω´ ・)", "(`ε´)", "(ﾒ `ﾛ ´)", "Σ (▼ □ ▼ メ)", "(҂ `з´)", "٩ (╬ʘ 益 ʘ╬) ۶",
        "↑ _ (ΦwΦ) Ψ", "(ﾉ ಥ 益 ಥ) ﾉ", "(`皿 ´ ＃)", "(`ー ´)", "ψ (`∇ ´) ψ", "(╬` 益 ´)", "(° ㅂ ° ╬)",
        "(‡ ▼ 益 ▼)", "(╬ Ò﹏Ó)", "← ~ (Ψ ▼ ｰ ▼) ∈", "(`ω ´)", "ヽ (`⌒´ メ) ノ", "ヾ (`ヘ ´) ﾉ ﾞ",
        "┌∩┐ (◣_◢) ┌∩┐", "ψ (▼ へ ▼ メ) ～ →", "(҂` ﾛ ´) 凸", "＼＼٩ (๑` ^ ´๑) ۶ ／／", "୧ ((# Φ 益 Φ #)) ୨",
        "ヽ (`д´ *) ノ", "凸 (`△ ´ ＃)", "ヽ (‵ ﹏´) ノ", "凸 (`ﾛ ´) 凸", "(ノ ° 益 °) ノ", "((╬◣﹏◢))",
        "(凸 ಠ 益 ಠ) 凸", "٩ (ఠ 益 ఠ) ۶"
      ],
    },
    sad: {
      img: sadIcon,
      langs: { vi: "sầu não" },
      icons: [
        "(ノ _ <。)", "(μ_μ)", "o (T ヘ Tới)", "(ﾟ ， _ ゝ ｀)", "(╥ω╥)", "(／ ˍ ・ 、)", "(つ ω`｡)", "(T_T)",
        "o (〒﹏〒) o", "(-_-)", "(ﾉ Д`)", "(; ω;)", "(个 _ 个)", "(╯_╰)", "(ノ _ <、)", "(｡T ω T｡)",
        "(> _ <)", "(｡ • ́︿ • ̀｡)", "(´-ω-`)", "(-ω- 、)", "(｡╯︵╰｡)", "(╯︵╰,)", "(╥_╥)", "(╥﹏╥)",
        "(ﾉ ω ･ ､)", "(っ ˘̩╭╮˘̩) っ", "(ಥ﹏ಥ)", ". ･ ﾟ ﾟ ･ (／ ω＼) ･ ﾟ ﾟ ･.", "。 ゜ ゜ (´Ｏ`) ゜ ゜。",
        "｡ ･ ﾟ ﾟ * (> д <) * ﾟ ﾟ ･｡", "｡ ･ ﾟ (ﾟ> <ﾟ) ﾟ ･｡", ".｡ ･ ﾟ ﾟ ･ (＞ _ ＜) ･ ﾟ ﾟ ･｡.",
        "｡ ﾟ (｡ ﾉ ω ヽ｡) ﾟ｡", "･ ﾟ ･ (｡> ω <｡) ･ ﾟ ･", "｡ ﾟ ･ (> ﹏ <) ･ ﾟ｡"
      ],
    },
    painful: {
      img: painfulIcon,
      langs: { vi: "đau đớn" },
      icons: [
        "~ (> _ <~)", "(× _ ×)", "(× ﹏ ×)", "٩ (× ×) ۶", "☆ ⌒ (> _ <)", "(x_x)", "☆ (＃ ××)",
        "_ 🙁 ´ ཀ `」 ∠): _", "☆ ⌒ (>。 <)", "(× _ ×) ⌒ ☆", "(＋ _ ＋)", "(☆ _ @)", "(x_x) ⌒ ☆", "[± _ ±]"
      ],
    },
    fear: {
      img: fearIcon,
      langs: { vi: "sợ" },
      icons: [
        "(ノ ω ヽ)", "(″ ロ ゛)", "(/ ω＼)", "(((＞ ＜)))", "▓▒░ (° ◡ °) ░▒▓", "(／。＼)", "(;;; * _ *)",
        "(/ _＼)", "{{(> _ <)}}", "(ﾉ _ ヽ)", "(・ 人 ・)", "〜 (＞ ＜) 〜", "＼ (º □ º l | l) /",
        ".. ・ ヾ (。 ＞ ＜) シ", "＼ (〇_ｏ) ／", "Σ (° △ ° |||) ︴", "〣 (ºΔº) 〣"
      ],
    }
  },
  neutralist: {
    img: neutralistIcon,
    apathetic: {
      img: apatheticIcon,
      langs: { vi: "thờ ơ" },
      icons: [
        "ヽ (ー _ ー) ノ", "┐ (￣ ヘ ￣) ┌", "┐ (￣ ～ ￣) ┌", "┐ (´ д `) ┌", "╮ (︶ ▽ ︶) ╭", "┐ (￣ ヮ ￣) ┌",
        "ヽ (´ ー `) ┌", "ヽ (￣ ～ ￣) ノ", "┐ (︶ ▽ ︶) ┌", "╮ (︶︿︶) ╭", "╮ (˘ ､ ˘) ╭", "ᕕ (ᐛ) ᕗ",
        "┐ (‘～ `) ┌", "╮ (￣_￣) ╭", "╮ (￣ ～ ￣) ╭", "┐ (￣∀￣) ┌", "┐ (˘_˘) ┌", "ヽ (￣д￣) ノ",
        "ヽ (ˇ ヘ ˇ) ノ", "¯ \\ _ (ツ) _ / ¯", "┐ (˘ ､ ˘) ┌", "╮ (˘_˘) ╭"
      ],
    },
    forgetful: {
      img: forgetfulIcon,
      langs: { vi: "lú lẫn" },
      icons: [
        "(￣ω￣;)", "┐ (‘～ `;) ┌", "(・ _ ・;)", "(＠ _ ＠)", "(• ิ _ • ิ)?", "ლ (¯ ロ ¯ “ლ)",
        "σ (￣ 、 ￣〃)", "(・ _ ・ ヾ", "(￣_￣) ・ ・ ・", "(・ ・;) ゞ", "(◎ ◎) ゞ", "(¯. ¯٥)", "(￣ ～ ￣;)",
        "(〃￣ω￣〃 ゞ", "╮ (￣ω￣;) ╭", "Σ (￣。￣ ﾉ)", "(ー ー;)", "(¯ ¯٥)", "(-_-;) ・ ・ ・",
        "┐ (￣ ヘ ￣;) ┌", "(¯. ¯;)", "(・ ・)?", "ლ (ಠ_ಠ ლ)"
      ],
    },
    suspect: {
      img: suspectIcon,
      langs: { vi: "nghi ngờ" },
      icons: [
        "(￢_￢)", "(¬_¬)", "(↼_↼)", "(→ _ →)", "(← _ ←)", "(⇀_⇀)", "(￢ ￢)", "(¬ ¬)", "(￢‿￢)", "(¬‿¬)"
      ],
    },
    surprise: {
      img: surpriseIcon,
      langs: { vi: "ngạc nhiên" },
      icons: [
        "w (° ｏ °) w", "(⊙_⊙)", "(° ロ °)!", "∑ (O_O;)", "ヽ (° 〇 °) ﾉ", "(o_O)", "(o_O)!", "(: ౦ ‸ ౦:)",
        "Σ (O_O)", "(O_O;)", "(□ _ □)", "Σ (° ロ °)", "(OO)", "Σ (□ _ □)"
      ],
    }
  },
  action: {
    img: actionIcon,
    greeting: {
      img: greetingIcon,
      langs: { vi: "lời chào" },
      icons: [
        "(* ・ Ω ・) ﾉ", "(^ – ^ *) /", "ヾ (* ‘▽’ *)", "(^ ０ ^) ノ", "(* ° ｰ °) ﾉ", "(￣ω￣) /",
        "(≧ ▽ ≦) /", "(￣ ▽ ￣) ノ", "(＠ ´ ー `) ﾉ ﾞ", "＼ (⌒ ▽ ⌒)", "~ ヾ (・ ω ・)", "(・ _ ・) ノ",
        "(´ ω `) ノ ﾞ", "(✧∀✧) /", "(° ▽ °) /", "(´ • ω • `) ﾉ", "ヾ (☆ ▽ ☆)", "(・ ∀ ・) ノ", "(o´ω`o) ﾉ",
        "(⌒ω⌒) ﾉ", "(o´ ▽ `o) ﾉ", "(´ ∀ `) ﾉ", "(° ∀ °) ﾉ ﾞ", "(´ ▽ `) ﾉ", "ヾ (・ ω ・ *)", "(´ ▽ `) /",
        "(o ^ ^ o) /", "(￣ ▽ ￣) /"
      ],
    },
    embrace: {
      img: embraceIcon,
      langs: { vi: "ôm" },
      icons: [
        "(づ ￣ ³￣) づ", "(⊃｡ • ́‿ • ̀｡) ⊃", "⊂ (´ • ω • `⊂)", "(~ * – *) ~", "(つ ≧ ▽ ≦) つ",
        "(つ. • ́ _ʖ • ̀.) つ", "⊂ (･ ω ･ * ⊂)", "(つ ✧ω✧) つ", "(っ ಠ‿ಠ) っ", "⊂ (￣ ▽ ￣) ⊃", "(づ ◕‿◕) づ",
        "(づ ◡﹏◡) づ", "⊂ (´ ▽ `) ⊃"
      ],
    },
    wink: {
      img: winkIcon,
      langs: { vi: "nháy mắt" },
      icons: [
        "(^ _ ~)", "(> ω ^)", "(^ _ <) 〜 ☆", "(^ _ <)", "(^. ~)", "(ﾟ ｏ⌒)", "(~ 人 ^)", "(^ 人 <) 〜 ☆",
        "(^ _−) ☆", "(^ _-) ≡ ☆", "(^ _-)", "☆ ⌒ (≧ ▽ °)", "(･ Ω <) ☆", "(^ ω ~)", "(-_ ・)",
        "☆ ⌒ (ゝ 。∂)", "(^. ~) ☆"
      ],
    },
    apologize: {
      img: apologizeIcon,
      langs: { vi: "xin lỗi" },
      icons: [
        "m (_ _) m", "人 (_ _ *)", "(シ..) シ", "(シ _ _) シ", "(* _ _) 人", "m (.) m", "m (_ _; m)",
        "<(_ _)>", "(m; _ _) m"
      ],
    },
    nosebleed: {
      img: nosebleedIcon,
      langs: { vi: "chảy máu mũi" },
      icons: [
        "(* ￣ii￣)", "(＾ 〃 ＾)", "(￣ ﾊ ￣ *)", "(￣ ¨ ヽ ￣)", "\\ (￣ ﾊ ￣)", "(￣; ￣)", "(＾ ་ ། ＾)",
        "(￣ ;; ￣)"
      ],
    },
    hiding: {
      img: hideIcon,
      langs: { vi: "ẩn nấp" },
      icons: [
        "| ･ Ω ･)", "| д ･)", "┬┴┬┴┤ ･ ω ･) ﾉ", "| ･ Д ･) ﾉ", "ﾍ (･ _ |", "| _￣))", "┬┴┬┴┤ (͡ ° ͜ʖ├┬┴┬┴",
        "| ʘ‿ʘ) ╯", "| ω ･) ﾉ", "| ▽ //)", "ヾ (･ |", "┬┴┬┴┤ (･ _├┬┴┬┴", "| _ ・)"
      ],
    },
    writing: {
      img: writeIcon,
      langs: { vi: "viết" },
      icons: [
        "__φ (．．)", "ヾ (`ー ´) シ φ__", "(^ ▽ ^) ψ__", "(￣ ー ￣) φ__", "__〆 (￣ ー ￣)",
        "…. φ (︶ ▽ ︶) φ ….", "__φ (。。)", "…. φ (・ ∀ ・ *)", "(..) φ__", "__φ (．．;)", "___ 〆 (・ ∀ ・)",
        "__φ (◎◎ ヘ)"
      ],
    },
    running: {
      img: runIcon,
      langs: { vi: "chạy" },
      icons: [
        "☆ ﾐ (o * ･ ω ･) ﾉ", "ε = ε = ε = ε = ┌ (; ￣ ▽ ￣) ┘", "ε === (っ ≧ ω ≦) っ",
        "C = C = C = C = C = ┌ (; ・ ω ・) ┘", "ε = ε = ┌ (> _ <) ┘", "ヽ (￣д￣;) ノ = 3 = 3 = 3",
        "─ = ≡Σ (((＞ ＜) つ", "C = C = C = C = ┌ (`ー ´) ┘", "。。。 ミ ヽ (。 ＞ ＜) ノ"
      ],
    },
    sleeping: {
      img: sleepIcon,
      langs: { vi: "ngủ" },
      icons: [
        "[(－－)] .. zzZ", "(￣o￣) zzZZzzZZ", "(＿ ＿ *) Z zz", "(－_－) zzZ", "((_ _)) .. zzzZZ",
        "(x. x) ~~ zzZ", "(∪｡∪) ｡｡｡ zzZ", "(￣ρ￣) .. zzZZ", "(－Ω－) zzZ", "(－.－) … zzz"
      ],
    }
  },
  animal: {
    img: animalIcon,
    cat: {
      img: catIcon,
      langs: { vi: "mèo" },
      icons: [
        "(= ^ ･ Ω ･ ^ =)", "(=; ｪ; =)", "(= ⌒‿‿⌒ =)", "(＾ • ω • ＾)", "ଲ (ⓛ ω ⓛ) ଲ",
        "(^ ◔ᴥ◔ ^)", "(= ^ ･ ｪ ･ ^ =)", "(= `ω´ =)", "(= ^ ◡ ^ =)", "(/ = ω =) /",
        "(^ = ◕ᴥ◕ = ^)", "(^ ◕ᴥ◕ ^)", "(= ①ω① =)", "(= ^ ‥ ^ =)", "(= ^ – ω – ^ =)", "ฅ (• ㅅ • ❀) ฅ",
        "(= ω =)", "ต (= ω =) ต", "(= ω =) .. meo meo", "(= ノ ω ヽ =)", "ヾ (= `ω´ =) ノ”",
        "ฅ (• ɪ •) ฅ", "", "(^ ˵◕ω◕˵ ^)", "(Φ ω Φ)"
      ],
    },
    bear: {
      img: bearIcon,
      langs: { vi: "gấu" },
      icons: [
        "(´ (ｴ) ˋ)", "(￣ (ｴ) ￣)", "⊂ (´ (ェ) ˋ) ⊃", "ʕ • ᴥ • ʔ", "(* ￣ (ｴ) ￣ *)", "ヽ (ˋ (ｴ) ´) ﾉ",
        "(/ – (ｴ) -＼)", "ʕ • ̀ ω • ́ ʔ", "ヽ (￣ (ｴ) ￣) ﾉ", "⊂ (￣ (ｴ) ￣) ⊃", "(/ ° (ｴ) °) /", "ʕ • ̀ o • ́ ʔ",
        "(／ ￣ (ｴ) ￣) ／", "(／ (ｴ) ＼)", "ʕ ᵔᴥᵔ ʔ"
      ],
    },
    dog: {
      img: dogIcon,
      langs: { vi: "chó" },
      icons: [
        "∪ ＾ ェ ＾ ∪", "Ｕ ^ 皿 ^ Ｕ", "∪ ･ ω ･ ∪", "ＵＴ ｪ ＴＵ", "∪￣-￣∪", "Ư ^ ｪ ^ Ư", "∪ ･ ｪ ･ ∪",
        "V ● ᴥ ● V"
      ],
    },
    rabbit: {
      img: rabbitIcon,
      langs: { vi: "thỏ" },
      icons: [
        "／ (≧ x ≦) ＼", "／ (= ･ X ･ =) ＼", "／ (･ × ･) ＼", "／ (^ × ^) ＼", "／ (= ´x` =) ＼",
        "／ (＞ × ＜) ＼", "／ (^ X ^) ＼", "／ (˃ ᆺ ˂) ＼"
      ],
    },
    pig: {
      img: pigIcon,
      langs: { vi: "lợn" },
      icons: [
        "(´ (00) ˋ)", "＼ (￣ (oo) ￣) ／", "(￣ (ω) ￣)", "｡ ﾟ (ﾟ ´ (00) `ﾟ) ﾟ｡", "ヽ (ˋ (00) ´) ノ",
        "(￣ (00) ￣)", "(´ (oo) ˋ)", "(ˆ (oo) ˆ)"
      ],
    },
    bird: {
      img: birdIcon,
      langs: { vi: "chim" },
      icons: [
        "(￣Θ￣)", "＼ (ˋ Θ ´) ／", "(･ Θ ･)", "(`･ Θ ･ ´)", "(ˋ Θ ´)", "(・ Θ ・)", "(◉Θ◉)",
        "ヾ (￣ ◇ ￣) ノ 〃"
      ],
    },
    fish: {
      img: fishIcon,
      langs: { vi: "cá" },
      icons: ["(°) #)) <<", "(°)) <<", "<・)))> <<", "> ^))) <～～", "ζ °))) 彡", "≧ (° °) ≦", "> °)))) 彡"],
    }
  },
  others: {
    img: othersIcon,
    friend: {
      img: friendIcon,
      langs: { vi: "bạn bè" },
      icons: [
        "ヾ (・ ω ・) メ (・ ω ・) ノ", "(* ^ ω ^) 八 (⌒ ▽ ⌒) 八 (-‿‿-) ヽ", "ヽ (⌒ω⌒) 人 (= ^ ‥ ^ =) ﾉ",
        "｡ *: ☆ (・ ω ・ 人 ・ ω ・) ｡: ゜ ☆｡", "(° (° ω (° ω ° (☆ ω ☆) ° ω °) ω °) °)",
        "(っ ˘ ▽ ˘) (˘ ▽ ˘) ˘ ▽ ˘ς)", "(* ＾ ω ＾) 人 (＾ ω ＾ *)", "＼ (▽ ￣ \\ (￣ ▽ ￣) / ￣ ▽) ／",
        "ヽ (∀ °) 人 (° ∀) ノ", "＼ (＾ ∀ ＾) メ (＾ ∀ ＾) ノ", "ヽ (≧ ◡ ≦) 八 (o ^ ^ o) ノ",
        "o (^^ o) (o ^^ o) (o ^^ o) (o ^^) o", "ヾ (・ ω ・ `) ノ ヾ (´ ・ ω ・) ノ ゛",
        "(((* ° ▽ ° *) 八 (* ° ▽ ° *)))", "٩ (๑ ･ ิ ᴗ ･ ิ) ۶٩ (･ ิ ᴗ ･ ิ ๑) ۶", "\\ (˙▿˙) / \\ (˙▿˙) /",
        "ヽ (⌒o⌒) 人 (⌒-⌒) ﾉ", "ヾ (￣ ー ￣ (≧ ω ≦ *) ゝ", "(* ・ ∀ ・) 爻 (・ ∀ ・ *)",
        "(((￣ (￣ (￣ ▽ ￣) ￣) ￣)))", "Ψ (`∀) (∀´) Ψ", "☆ ヾ (* ´ ・ ∀ ・) ﾉ ヾ (・ ∀ ・ `*) ﾉ ☆",
        "(☞ ° ヮ °) ☞ ☜ (° ヮ ° ☜)"
      ],
    },
    enemy: {
      img: enemyIcon,
      langs: { vi: "kẻ thù" },
      icons: [
        "ヽ (･ ∀ ･) ﾉ _θ 彡 ☆ Σ (ノ `Д´) ノ", "(* `0´) θ ☆ (メ ° 皿 °) ﾉ", "(; -_-) ―――――― C <―_-)",
        "ヽ (> _ <ヽ) ―⊂ | = 0 ヘ (^ ‿ ^)", "(҂` ﾛ ´) ︻ デ Feat 一 ＼ (º □ º l | l) /",
        "/ (. □.) ＼ ︵╰ (° 益 °) ╯︵ /(.□. /)", "(`⌒ *) O- (` ⌒´Q)", "(っ • ﹏ •) っ ✴ == ≡ 눈 ٩ (`皿 ´҂) ง",
        "(* ´∇`) ┌θ ☆ (ﾉ> _ <) ﾉ", "(o¬‿¬o) … ☆ ﾐ (* x_x)", "＜ (￣︿￣) ︵θ︵θ︵ ☆ (＞ 口 ＜ -)",
        "ヘ (> _ <ヘ) ￢o (￣‿￣ ﾒ)", "(╯ ° Д °) ╯︵ /(.□. ＼)", "(ﾉ -.-) ﾉ…. (((((((((((● ~ * (> _ <)",
        "(((ง ‘ω’) و 三 ง ‘ω’) ڡ≡ ☆ ⌒ ﾐ ((x_x)", "(｢• ω •)｢ (⌒ω⌒`)", "(￣ω￣) ノ ﾞ ⌒ ☆ ﾐ (o _ _) o",
        "(╬￣ 皿 ￣) = ○ ＃ (￣ #) ３￣)", "(￣ε (# ￣) ☆ ╰╮o (￣ ▽ ￣ ///)",
        ",, (((￣ □) _ ／ ＼_ (○ ￣))) ,,", "(¬_¬ ”) ԅ (￣ε￣ԅ)", "!! (ﾒ ￣ ￣) _θ ☆ ° 0 °) /",
        "(ง ಠ_ಠ) ง σ (• ̀ ω • ́ σ)", "(° ᴗ °) ~ ð (/ ❛o❛ \\)"
      ],
    },
    weapon: {
      img: weaponIcon,
      langs: { vi: "vũ khí" },
      icons: [
        "(・ ∀ ・) ・ ・ ・ ——– ☆", "(-ω -) ／ 占 ~~~~~", "○ ∞∞∞∞ ヽ (^ ー ^)", "(* ＾＾) / ~~~~~~~~~~ ◎",
        "(((￣ □) _ ／", "(ﾒ ￣ ▽ ￣) ︻┳ppers 一", "(/ -_ ・) / D ・ ・ ・ ・ ・ —— →",
        "(/ ・ ・) ノ ((く ((へ", "(; ・ _ ・) ―――― C", "￢o (￣-￣ ﾒ)", "(ﾒ `ﾛ ´) ︻ デ Feat",
        "✴ == ≡ 눈 ٩ (`皿 ´҂) ง", "(^ ω ^) ノ ﾞ (((((((((● ～ *", "―⊂ | = 0 ヘ (^^)",
        "(ಠ o ಠ) ¤ = [] :::::>", "– (T_T) →", "(´-ω ･) ︻┻┳ ━ ━", "Q (`⌒´Q)"
      ],
    },
    magic: {
      img: magicIcon,
      langs: { vi: "ma thuật" },
      icons: [
        "(ノ ˘_˘) ノ ζ ||| ζ ζ ||| ζ ζ ||| ζ", "(ノ ° ∀ °) ノ ⌒ ･ *: .｡. .｡.: * ･ ゜ ﾟ ･ * ☆",
        "(⊃｡ • ́‿ • ̀｡) ⊃━✿✿✿✿✿✿", "(∩` ﾛ ´) ⊃━ 炎炎 炎炎 炎", "(ﾉ ≧ ∀ ≦) ﾉ ‥… ━━━ ★",
        "╰ (͡ ° ͜ʖ ͡ °) つ ── ☆ *: ・ ﾟ", "(∩ ᄑ _ ᄑ) ⊃━ ☆ ﾟ * ･｡ * ･: ≡ (ε 🙂",
        "(ﾉ> ω <) ﾉ:｡ ･: *: ･ ﾟ ‘★ ,｡ ･: *: ･ ﾟ’ ☆", "(＃ ￣ □ ￣) o━∈ ・ ・ ━━━━ ☆",
        "(/ ￣ ー ￣) / ~~ ☆ ‘. ･. ･: ★’. ･. ･: ☆"
      ],
    },
    food: {
      img: foodIcon,
      langs: { vi: "món ăn" },
      icons: [
        "(っ ˘ڡ˘ ς)", "(˘ ▽ ˘) っ ♨", "(・ Ω ・) ⊃- [二 二]", "(* ´ ー `) 旦 旦 (￣ω￣ *)",
        "(￣ ▽ ￣) [] [] (≧ ▽ ≦)", "(* ￣ ▽ ￣) 旦 且 (´∀` *)", "(o˘◡˘o) ┌iii┐", "♨o (> _ <) o♨",
        "(・ ・) つ – {} @ {} @ {} –", "(* ´з`) 口 ﾟ｡ ﾟ 口 (・ ∀ ・)", "(* ^^) o∀ * ∀o (^^ *)",
        "– ●●● -ｃ (・ ・)", "(‘ω’) 旦 ~~", "(・ Ω ・) o – {{[〃]}}", "(・ ・) つ – ●●●",
        "(o ^ ^ o) 且 且 (´ω` *)", "(^^) _ 旦 ~~ ~~ Ư _ (^^)", "(・ ・) つ – ● ○ ◎ –"
      ],
    },
    music: {
      img: musicIcon,
      langs: { vi: "âm nhạc" },
      icons: [
        "ヾ (´〇`) ﾉ ♪♪♪", "ヽ (o´∀`) ﾉ ♪ ♬", "♪ ♬ ((d⌒ω⌒b)) ♬ ♪", "└ (＾＾) ┐", "(￣ ▽ ￣) /♫•*¨*•.¸¸♪",
        "ヾ (⌐ ■ _ ■) ノ ♪", "乁 (• ω • 乁)", "♬ ♫ ♪ ◖ (● o ●) ◗ ♪ ♫ ♬", "ヘ (￣ω￣ ヘ)", "(ﾉ ≧ ∀ ≦) ﾉ",
        "└ (￣-￣└))", "┌ (＾＾) ┘", "(^ _ ^ ♪)", "(〜￣ △ ￣) 〜", "(｢• ω •)｢", "(˘ ɜ˘) ♬ ♪ ♫",
        "(〜￣ ▽ ￣) 〜", "♪ ヽ (^^ ヽ) ♪", "((┘￣ω￣) ┘", "＼ (￣ ▽ ￣) ＼", "(~ ˘ ▽ ˘) ~", "(~ ‾ ▽ ‾) ~",
        "⁽⁽◝ (• ω •) ◜⁾⁾", "♪♪♪ ヽ (ˇ∀ˇ) ゞ", "〜 (￣ ▽ ￣〜)", "♪ (/ _ _) / ♪", "√ (￣ ‥ ￣√)",
        "／ (￣ ▽ ￣) ／", "~ (˘ ▽ ˘ ~)", "~ (˘ ▽ ˘) ~", "✺◟ (• ω •) ◞✺"
      ],
    },
    game: {
      img: gameIcon,
      langs: { vi: "trò chơi" },
      icons: [
        "(^^) p _____ | _o ____ q (^^)", "ヽ (^ o ^) ρ┳┻┳ ° σ (^ o ^) ノ",
        "(ノ -_-) ノ ﾞ _ □ VS □ _ ヾ (^ – ^ ヽ)", "Ю ○ 三 ＼ (￣ ^ ￣＼)", "(／ O ^) / ° ⊥ ＼ (^ o＼)",
        "(／ _ ^) ／ ● ＼ (^ _ ＼)", "ヽ (； ^ ^) ノ ﾞ ．．．…___ 〇",
        "! (; ﾟ o ﾟ) o / ￣￣￣￣￣￣￣ ~> ﾟ)))) 彡", "“((≡ | ≡)) _ ／ ＼ _ ((≡ | ≡))”",
        "(= O * _ *) = OQ (* _ * Q)"
      ],
    },
    face: {
      img: faceIcon,
      langs: { vi: "khuôn mặt" },
      icons: [
        "(͡ ° ͜ʖ ͡ °)", "(. • ́ _ʖ • ̀.)", "(ಠ ͜ʖ ಠ)", "(͡ ͜ʖ ͡)", "(ʘ ͜ʖ ʘ)", "(͡ ° ʖ̯ ͡ °)", "(ఠ ͟ʖ ఠ)",
        "(ಥ ʖ̯ ಥ)", "(≖ ͜ʖ≖)", "(; ´ ༎ ຶ ٹ ༎ ຶ `)", "(͠ ° ͟ʖ ͡ °)", "(͡ಠ ʖ̯ ͡ಠ)", "(͡ • ͜ʖ ͡ •)", "(ʘ ʖ̯ ʘ)",
        "(͡ᵔ ͜ʖ ͡ᵔ)", "(ಠ ʖ̯ ಠ)", "(･ ิ ͜ʖ ･ ิ)", "(ʘ ͟ʖ ʘ)"
      ],
    },
    special: {
      img: specialIcon,
      langs: { vi: "đặc biệt" },
      icons: [
        "٩ (ˊ〇ˋ *) و", "(￣ ^ ￣) ゞ", "(－‸ლ)", "(╯ ° 益 °) ╯ 彡 ┻━┻", "(╮ ° – °) ╮┳━━┳ (╯ ° □ °) ╯ ┻━━┻",
        "┬─┬ ノ (º _ º ノ)", "(oT-T) 尸", "(͡ ° ͜ʖ ͡ °)", "[̲̅ $ ̲̅ (̲̅ ͡ ° ͜ʖ ͡ ° ̲̅) ̲̅ $ ̲̅]", "(ಠ_ಠ)",
        "౦０o｡ (‾́。‾́) y ~~", "(￣﹃￣)", "(x (x_ (x_x (O_o) x_x) _x) x)", "(･ Ω ･) ☞", "(⌐ ■ _ ■)", "(◕‿◕✿)",
        "(￣.) O- 【TV】", "｀ 、 ヽ ｀ ヽ ｀ 、 ヽ (ノ ＞ ＜) ノ ｀ 、 ヽ ｀ ☂ ヽ ｀ 、 ヽ",
        "‿︵‿︵‿︵‿ ヽ (° □ °) ノ ︵‿︵‿︵‿︵",
        "(•) (•) ԅ (≖‿≖ԅ)", "(＾ ▽ ＾) っ ✂╰⋃╯", "〜〜 (／ ￣ ▽) ／ 〜ф",
        "ଘ (੭ˊᵕˋ) ੭ * ੈ✩‧₊˚", "ଘ (੭ˊ ꒳ ˋ) ੭✧", "_ (: 3 」∠) _", "∠ (ᐛ 」∠) _"
      ],
    },
  },
};
